docs/quiz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-30 Sun 20:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>SWE 619</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thanhvu Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaad4180">1. Quiz 1</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaad4180" class="outline-2">
<h2 id="orgaad4180"><span class="section-number-2">1</span> Quiz 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgee4afea" class="outline-3">
<h3 id="orgee4afea"><span class="section-number-3">1.1</span> equal (the first equal implementation in in-class exercise 1)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Give 2 inputs such that the results from the specs (Javadoc) and implementation agree</li>
<li>Give 2 inputs such that the results from the specs (Javadoc) and implementation disagree</li>
</ul>
</div>
</div>

<div id="outline-container-org32b4e79" class="outline-3">
<h3 id="org32b4e79"><span class="section-number-3">1.2</span> Contracts for a Binary Search implementation.</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>specifiy the contracts/specifications for binary search implementation. Remember for precondition you want something as weak as possible and for postcondition as strong as possible.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
